cfdRibletFramework/foamCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
     (-0.635 -0.3 -0.063)
     (1.27 -0.3 -0.063)
     (1.27 0.3 -0.063)
     (-0.635 0.3 -0.063)
     (-0.635 -0.3 0.7)
     (1.27 -0.3 0.7)
     (1.27 0.3 0.7)
     (-0.635 0.3 0.7)	
	
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }


    bottomWall
    {
      type wall;
        faces
	  (
	   (1 5 4 0)
	  );
    }

    inlet
    {
        type inlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type outlet;
        faces
        (
            (2 6 5 1)
        );
    }
    sym
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    sideWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
