cfdRibletFramework/foamCase/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    topWall
    {
        type            calculated;
        value           uniform 0;
    }

    bottomWall
      {
        type            calculated;
        value           uniform 0;
      }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
      {
        type            calculated;
        value           uniform 0;
      }

    sideWall
      {
        type            calculated;
        value           uniform 0;
      }

    motorBike
      {
        type            nutkWallFunction;
        value           uniform 0;
      }
    
    sym
      {
	type            symmetryPlane;
      }
}


// ************************************************************************* //
