cfdRibletFramework/foamCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-9;
        //relTol          0.01;
        maxIters        500;
    }

    "(U|k|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        nSweeps         2;
        tolerance       1e-9;
        //relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
    pRefPoint      (-0.4 0.2 0);
    pRefValue       0;

    residualControl
	{
		p               2e-5;
		U               2e-5;
	}

}

relaxationFactors
{
	fields
	{
		p		0.3;
	}

	equations
	{
		U		0.7;
		k		0.5;
		omega	0.5;
	}
}


// ************************************************************************* //
